/*
 * TODO:
 *  1. 처음 렌더링이 되면
 *    1-1. To-do 라는 타이틀이 보여야 한다.
 *    1-1-2. 할 일 이라는 입력창 타이틀과 입력창이 보여야 한다.
 *    1-1.3 할 일이 없어요! 라는 placeholder 값이 보여야 한다.
 *  2. 입력값이 없을 때
 *    2-1. 할 일이 없어요! 라는 placeholder 값이 보여야 한다.
 *  3. 입력값이 있을 때
 *    3-1. 해당 입력값이 입력창에 보여야 한다.
 *  4. 할 일 목록이 보여야 한다.
 *    4-1. 할 일 목록이 없으면 할 일이 없어요! 라는 placeholder 값이 보여야 한다.
 *    4-2. 할 일 목록이 있으면 할 일 목록이 보여야 한다.
 *  5. 글을 입력하면 입력창에 글이 보여야 한다.
 *    5-1. change 이벤트가 잘 넘어 오는지 확인한다.
 *  6. 글 추가 버튼을 누를 때
 * 		6-1. 할 일 목록에 추가 되야 한다.
 *    6-2. 입력창에 값이 비워진다.
 */
